research/visualization_methods/outputs/InferenceModel__path_planning_model/path_planning_model.dot
digraph G {
  "Dict" [label="Dict"];
  "GammaShapeRate" [label="GammaShapeRate"];
  "Halfspace" [label="Halfspace"];
  "I" [label="I"];
  "KeepLast" [label="KeepLast"];
  "MvNormal" [label="MvNormal"];
  "MvNormalMeanCovariance" [label="MvNormalMeanCovariance"];
  "StableRNG" [label="StableRNG"];
  "agents" [label="agents"];
  "avg_control_magnitude" [label="avg_control_magnitude"];
  "c" [label="c"];
  "callbacks" [label="callbacks"];
  "combined_callback" [label="combined_callback"];
  "constraints" [label="constraints"];
  "control" [label="control"];
  "control_variance" [label="control_variance"];
  "controls" [label="controls"];
  "covariance" [label="covariance"];
  "create_door_environment" [label="create_door_environment"];
  "create_standard_agents" [label="create_standard_agents"];
  "d" [label="d"];
  "dσ2" [label="dσ2"];
  "elbo_values" [label="elbo_values"];
  "environment" [label="environment"];
  "for" [label="for"];
  "function" [label="function"];
  "g" [label="g"];
  "gamma_scale" [label="gamma_scale"];
  "gamma_shape" [label="gamma_shape"];
  "goal_constraint_variance" [label="goal_constraint_variance"];
  "goals" [label="goals"];
  "h" [label="h"];
  "hasfield" [label="hasfield"];
  "in" [label="in"];
  "initial_state_variance" [label="initial_state_variance"];
  "intermediate_dir" [label="intermediate_dir"];
  "joinpath" [label="joinpath"];
  "k" [label="k"];
  "length" [label="length"];
  "local nr_agents" [label="local nr_agents"];
  "local rs" [label="local rs"];
  "map" [label="map"];
  "max_uncertainty" [label="max_uncertainty"];
  "maximum" [label="maximum"];
  "mean" [label="mean"];
  "merge" [label="merge"];
  "metadata" [label="metadata"];
  "model" [label="model"];
  "model_params" [label="model_params"];
  "nr_agents" [label="nr_agents"];
  "nr_steps" [label="nr_steps"];
  "output_dir" [label="output_dir"];
  "path" [label="path"];
  "path_planning_constraints" [label="path_planning_constraints"];
  "path_planning_model" [label="path_planning_model"];
  "path_vars" [label="path_vars"];
  "paths" [label="paths"];
  "q" [label="q"];
  "q(control)" [label="q(control)"];
  "q(d, dσ2)" [label="q(d, dσ2)"];
  "q(dσ2)" [label="q(dσ2)"];
  "q(z, zσ2)" [label="q(z, zσ2)"];
  "q(zσ2)" [label="q(zσ2)"];
  "repeat" [label="repeat"];
  "results" [label="results"];
  "returnvars" [label="returnvars"];
  "rng" [label="rng"];
  "rs" [label="rs"];
  "seed" [label="seed"];
  "state" [label="state"];
  "t" [label="t"];
  "v" [label="v"];
  "var" [label="var"];
  "z" [label="z"];
  "zσ2" [label="zσ2"];
  "γ" [label="γ"];
  "μ(path)" [label="μ(path)"];
  "μ(state)" [label="μ(state)"];
  "Dict" -> "callbacks";
  "GammaShapeRate" -> "dσ2";
  "GammaShapeRate" -> "zσ2";
  "Halfspace" -> "d";
  "Halfspace" -> "z";
  "I" -> "control";
  "I" -> "goals";
  "I" -> "state";
  "KeepLast" -> "returnvars";
  "MvNormal" -> "control";
  "MvNormal" -> "goals";
  "MvNormal" -> "state";
  "MvNormalMeanCovariance" -> "μ(path)";
  "MvNormalMeanCovariance" -> "μ(state)";
  "StableRNG" -> "rng";
  "agents" -> "local nr_agents";
  "agents" -> "local rs";
  "agents" -> "model";
  "agents" -> "nr_agents";
  "c" -> "avg_control_magnitude";
  "control_variance" -> "control";
  "controls" -> "avg_control_magnitude";
  "covariance" -> "control";
  "covariance" -> "goals";
  "covariance" -> "state";
  "create_door_environment" -> "environment";
  "create_standard_agents" -> "agents";
  "dσ2" -> "d";
  "elbo_values" -> "results";
  "environment" -> "d";
  "environment" -> "model";
  "environment" -> "z";
  "for" -> "avg_control_magnitude";
  "for" -> "max_uncertainty";
  "function" -> "combined_callback";
  "g" -> "z";
  "gamma_scale" -> "dσ2";
  "gamma_scale" -> "zσ2";
  "gamma_shape" -> "dσ2";
  "gamma_shape" -> "zσ2";
  "goal_constraint_variance" -> "goals";
  "h" -> "d";
  "hasfield" -> "elbo_values";
  "in" -> "avg_control_magnitude";
  "in" -> "max_uncertainty";
  "initial_state_variance" -> "state";
  "joinpath" -> "intermediate_dir";
  "k" -> "goals";
  "k" -> "z";
  "length" -> "local nr_agents";
  "length" -> "nr_agents";
  "map" -> "local rs";
  "maximum" -> "max_uncertainty";
  "mean" -> "avg_control_magnitude";
  "mean" -> "control";
  "mean" -> "controls";
  "mean" -> "goals";
  "mean" -> "paths";
  "mean" -> "state";
  "merge" -> "results";
  "metadata" -> "combined_callback";
  "model_params" -> "model";
  "nr_agents" -> "q(zσ2)";
  "nr_steps" -> "model";
  "nr_steps" -> "q(control)";
  "nr_steps" -> "q(dσ2)";
  "nr_steps" -> "q(zσ2)";
  "output_dir" -> "intermediate_dir";
  "path" -> "z";
  "path_planning_constraints" -> "constraints";
  "path_planning_model" -> "model";
  "path_vars" -> "max_uncertainty";
  "q" -> "q(d, dσ2)";
  "q" -> "q(z, zσ2)";
  "repeat" -> "q(control)";
  "repeat" -> "q(dσ2)";
  "repeat" -> "q(zσ2)";
  "results" -> "results";
  "rs" -> "d";
  "rs" -> "z";
  "seed" -> "rng";
  "state" -> "goals";
  "t" -> "d";
  "t" -> "z";
  "v" -> "max_uncertainty";
  "var" -> "path_vars";
  "zσ2" -> "z";
  "γ" -> "d";
  "γ" -> "z";
}
